_S469_BYD_E6K_ACCP()
$Init();
CAN,11位,500K,pin:6+14,f8c0/f9c0/ffe0,30帧{30 00 00},period:0/2000/100/0/6000,
in{10 03},
link{80 01 3e}1,3000ms//不合法
exit{null},
$$$

+1[数据流](Spec)
//以下是逻辑错误 : 
$Str();
&"行使里程",                      {22 c9 07},cf,d4*26244+d5*1024,.0,km;//不合逻辑，系数比例不对
&"行使里程",                      {22 c9 07},cf,d4*+d5*1024,.0,km;//不合法，运算符后无数字
***
$Str();
*"空调面板循环指示灯",             {22 e0 1e},3f,d4,'00:循环','01:新鲜','02:自动内循环','03:保留的'04;//不合法 缺少oth
&"行使里程",               6       {22 c9 07},cf,d4*262144-2500+d5*1024,.0,km;//不合法
*"EPB状态",                       {22 2e 10},3f,d4,'00:无效','01:保持模式',':保持模式下释放',':正在释放',':正在制动',':释放完成','06:制动完成','07:最大制动力制动','08:最大制动力制动完成','09:动态制动','oth:---';//不合法，索引没有
*"整车配置信息(变速器型式)",      {22 c1 01},3f,d5,'00-01:MT','02-03:AT','04-05:AMT','oth:---'8;//不合法，循环数必须2位或4位
*"主动放电请求",                  {22 c9 10},3f,d4,'00-1f:无请求','20-3f:---'40;//不合法，循环缺少oth会不循环
*"电池管理系统（BMS）散热水泵状态反馈",          {22 d0 16},3f,d4,'00:无故障','01:空运行','02:停滞或过电流','03:过温','04:低速','05:低于或超过电压','06通讯丢失','07控制电路故障','oth:---';//不合法，缺少冒号
*"发动机故障等级",        {22 d0 20},3f,d4,'00:正常','01:1级',' 02:2级',' 03:3级',' 04:4级','oth:---';//不合法，索引不能有空格
&"行使里程",                      {22 c9 07},cf,d4=*26244+d5*1024,.0,km;//不合法，算式格式错误;
*"LCD背光占空比",    {22 63 1c},3c,d4,.0,"%",'00-64:d4','oth:无效值';//不合法，3c中文要加星号
*"电机控制器直流电压是否在范围内",      {22 b0 04},3f,d4,'00:是','01:否','oth:未定义',':';//不合法，没有索引。
***
$$$


+1[读故障码](Spec)
$ReadDtc();
{18 00 00 ff}id=null,num=d2,start=d3,code=2,space=3,state=null;
$$$

+1[清故障码](Spec)
$ClearDtc();{14 00 ff}
$$$

+1[动作测试](Spec)
$Button();
"打开"{67 88 99}//不合法，button缺少分号会继续执行下一行。
"关闭"{67 88 99};

$Input(10,t0=val#256,t1=val%256){2f e0 10 03 t0 t1};//不合法，10模式缺少Range
$Input(range=0-65535,10,t0=val#256,t1=val%256){2f e0 10 03 t0 t1};//不合法，参数位置不可随意
$Display(){"nnn};//不合法
Display(){"nnn"};//不合法，缺$
$$$