_S470_BYD_E6K_BH()
$Init();
CAN,11位,500K,pin:6+14,ec60/ed60/ffe0,30帧{30 00 00},period:0/2000/100/0/6000,
in{10 03},
link{3e 80}1,3000ms,
exit{null},
$$$

+1[版本信息](Spec)
$Ecu();
*"硬件版本",                   {22 F1 93},cf,d4*(1)+(0),.0,;// =4
*"硬件日期",                   {22 F1 93},bb,d5,"年",d6,"月",d7,"日";
*"软件编号",                   {22 F1 94},16,d4-d12;
*"软件版本",                   {22 F1 95},cf,d4d5*(1)+(0),.0,;// =4-5
*"软件日期",                   {22 F1 95},bb,d6,"年",d7,"月",d8,"日";
*"修改次数",                   {22 F1 95},cf,d9*(1)+(0),.0,;// =9

***
$$$

+1[读故障码](Spec)
$ReadDtc();
{19 02 09}id=null,num=null,start=d4,code=3,space=4,state=null;
$$$




+1[清故障码](Spec)
$ClearDtc();{14 00 ff}
$$$

+1[特殊功能](Spec)

$Send(){2e f1 12 f[1][1]6 f[2][1]};//合法
$InputBox(0a,len=3,f[1]);
"提交"L0;
"结束"L_EXIT;

$$$






_S000_GG.G(UUUU);//合法，只识别_S，后面加()是为了让编辑器以为是函数
$Init();
CAN,11位,500K,pin:6+14,ec60/ed60/ffe0,30帧{30 00 00},period:0/2000/100/0/6000,
in{81 81}/{80 02 10 86}PSW27(62),//合法
link{80 01}1,3000ms,//合法
exit{80 01 20}/{80 01 82},//合法
$$$

+1[测试](+)//合法，结束符可在后面
$$$
+2[菜单2](Spec)
$Str();
*"行使里程",                      {22 c9 07},16,d4-d5;//合法
*"行使里程"                      ,{22 c9 07},16,d4-d5;//合法
***
$$$

+2[菜单3](Spec)
$Display(){"nnn"};//合法
$Display(){"nnn"}//合法

$gotolab(L_EXIT);//合法
$lab(L_EXIT)

$Input(10,range=1-8178,t0=val>>0x8, t1=val&0xff){2f 67 ea 03 t0 t1};//合法




$str()
*"行使里程",                      {22 c9 07},cf,d4*262144-2500+d5*1024,.0,km;//合法 测试空格的影响
*"行使里程",                      {22 c9 07},cf,d4*262144-2500+d5*1024,.0,km;//合法
*"行使里程",                      {22 c9 07},cf,d4*262144+d5*1024,.0,km;//合法
*"轮胎监控器           ",{22 63 22},3f,d4,'00:关闭','01:TPMS警告(低压)','02:预防爆胎的轮胎压力检测系统','03:N/A','oth:--'04循环;//合法
*"轮胎监控器           ",{22 63 22},3f,d4,'00:关闭','01:TPMS警告(低压)','02:预防爆胎的轮胎压力检测系统','03: N/A','oth:--'04循环;//合法
*"摄像头遮挡原因",                        {22 b0 3b},3f,d4d5,'0001:模糊的污点','0002:挡风玻璃结冰','0004:完全堵塞','0008:部分堵塞','0010:污点','0020:光线不足','0040:图像模糊','0080:道路上有飞尘','0100:光线较强','0200:自身眩目','oth:---'0400;//合法
***

$Send(){85 30 02 07 ff 05}/{85 30 02 07 ff 00}/{84 30 15 07 ff}/{85 30 02 07 ff 50}/{85 30 02 07 ff 00};//合法
$Input(10,range=0-65535,t0=val#256,t1=val%256){2f e0 10 03 t0 t1};//合法


$Button();
"打开"{2f 10 04 03 ff};
"关闭"{2f 10 04 03 00};

$Button(7f+-1);
"增加"{2f 20 11 03 t0};
"减少"{2f 20 11 03 t0};
$Send(){2f 20 11 00};

$Button(7f+-8);//合法
"增加"{2f 20 11 03 t0};
"减少"{2f 20 11 03 t0};

$ReadDtc();
{19 02 09}id=149,num=null,start=d4,code=3,space=4,state=null;//合法

$lab(gg)//合法

$if(f[1][30]:00);//合法
$elseif(f[1][23]:02);//合法
$ELseif(f[1][23]:02);//合法
$endif()

$$$

_s
$Init();
CAN,11位,500K,pin:6+14,ec60/ed60/ffe0,30帧{30 00 00},period:0/2000/100/0/6000,
in{81 81}PSW27(62),//合法
link{80 01}1,3000ms,//合法
exit{80 01 20}/{80 01 82},//合法
$$$
+1[菜单](+)$$$