_S469_BYD_E6K_ACCP()
$Init();
CAN,11位,500K,pin:6+14,f8c0/f9c0/ffe0,30帧{30 00 00},period:0/2000/100/0/6000,
in{10 03},
link{80 01 3e}1,3000ms//不合法
exit{null},
$$$

+1[数据流](Spec)
$Str();
*"空调面板循环指示灯",             {22 e0 1e},3f,d4,'00:循环','01:新鲜','02:自动内循环','03:保留的'04;//不合法 缺少oth
&"行使里程",               6       {22 c9 07},cf,d4*262144-2500+d5*1024,.0,km;//不合法
*"EPB状态",                       {22 2e 10},3f,d4,'00:无效','01:保持模式',':保持模式下释放',':正在释放',':正在制动',':释放完成','06:制动完成','07:最大制动力制动','08:最大制动力制动完成','09:动态制动','oth:---';//不合法，索引没有
*"整车配置信息(变速器型式)",      {22 c1 01},3f,d5,'00-01:MT','02-03:AT','04-05:AMT','oth:---'8;//不合法，循环数必须2位或4位
*"主动放电请求",                  {22 c9 10},3f,d4,'00-1f:无请求','20-3f:---'40;//不合法，循环缺少oth会不循环
*"电池管理系统（BMS）散热水泵状态反馈",          {22 d0 16},3f,d4,'00:无故障','01:空运行','02:停滞或过电流','03:过温','04:低速','05:低于或超过电压','06通讯丢失','07控制电路故障','oth:---';//不合法，缺少冒号
*"发动机故障等级",        {22 d0 20},3f,d4,'00:正常','01:1级',' 02:2级',' 03:3级',' 04:4级','oth:---';//不合法，索引不能有空格
&"行使里程",                      {22 c9 07},cf,d4=*26244+d5*1024,.0,km;//不合法，算式格式错误;
*"LCD背光占空比",    {22 63 1c},3c,d4,.0,"%",'00-64:d4','oth:无效值';//不合法，3c中文要加星号
*"电机控制器直流电压是否在范围内",      {22 b0 04},3f,d4,'00:是','01:否','oth:未定义',':';//不合法，没有索引。
***
$$$

+1[读故障码](Spec)
$ReadDtc();
{18 00 00 ff}id=null,num=d2,start=d3,code=2,space=3,state=null;
$$$

+1[清故障码](Spec)
$ClearDtc();{14 00 ff}
$$$

+1[动作测试](Spec)
$Button();
"打开"{67 88 99}//不合法，button缺少分号会继续执行下一行。
"关闭"{67 88 99};

$Input(10,t0=val#256,t1=val%256){2f e0 10 03 t0 t1};//不合法，10模式缺少Range
$Input(range=0-65535,10,t0=val#256,t1=val%256){2f e0 10 03 t0 t1};//不合法，参数位置不可随意
$Display(){"nnn};//不合法
Display(){"nnn"};//不合法，缺$
$$$

//以下合法 :"
_S470_BYD_E6K_BH()
$Init();
CAN,11位,500K,pin:6+14,ec60/ed60/ffe0,30帧{30 00 00},period:0/2000/100/0/6000,
in{10 03},
link{3e 80}1,3000ms,
exit{null},
$$$

+1[版本信息](Spec)
$Ecu();
*"硬件版本",                   {22 F1 93},cf,d4*(1)+(0),.0,;// =4
*"硬件日期",                   {22 F1 93},bb,d5,"年",d6,"月",d7,"日";
*"软件编号",                   {22 F1 94},16,d4-d12;
*"软件版本",                   {22 F1 95},cf,d4d5*(1)+(0),.0,;// =4-5
*"软件日期",                   {22 F1 95},bb,d6,"年",d7,"月",d8,"日";
*"修改次数",                   {22 F1 95},cf,d9*(1)+(0),.0,;// =9

***
$$$

+1[读故障码](Spec)
$ReadDtc();
{19 02 09}id=null,num=null,start=d4,code=3,space=4,state=null;
$$$




+1[清故障码](Spec)
$ClearDtc();{14 00 ff}
$$$

+1[特殊功能](Spec)

$Send(){2e f1 12 f[1][1]6 f[2][1]};//合法
$InputBox(0a,f[1]);//合法
$$$







+1[测试](+)//合法，结束符可在后面
_S000_GG.G(UUUU);//合法，只识别_S，后面加()是为了让编辑器以为是函数
&"行使里程",                      {22 c9 07},16,d4d5;//合法;
&"行使里程"                      ,{22 c9 07},16,d4d5;//合法;
$Display(){"nnn"};//合法
$Display(){"nnn"}//合法
$gotolab(L_EXIT);//合法
$Input(10,range=1-8178,t0=val>>0x8, t1=val&0xff){2f 67 ea 03 t0 t1};//合法
exit{80 01 20}/{80 01 82},//合法
link{80 01}1,3000ms,//合法
in{81 81}/{80 02 10 86}PSW27(62),//合法
in{81 81}PSW27(62),//合法
 //测试无内容情况
 *"行使里程",                      {22 c9 07},cf,d4*262144-2500+d5*1024,.0,km;//合法 测试空格的影响
&"行使里程",                      {22 c9 07},cf,d4*262144-2500+d5*1024,.0,km;//合法
 *"行使里程",                      {22 c9 07},cf,d4*262144+d5*1024,.0,km;//合法
  *"行使里程",//合法 这在Act()中合法
$Send(){85 30 02 07 ff 05}/{85 30 02 07 ff 00}/{84 30 15 07 ff}/{85 30 02 07 ff 50}/{85 30 02 07 ff 00};//合法
*"轮胎监控器           ",{22 63 22},3f,d4,'00:关闭','01:TPMS警告(低压)','02:预防爆胎的轮胎压力检测系统','03:N/A','oth:--'04循环;//合法
*"轮胎监控器           ",{22 63 22},3f,d4,'00:关闭','01:TPMS警告(低压)','02:预防爆胎的轮胎压力检测系统','03: N/A','oth:--'04循环;//合法
*"摄像头遮挡原因",                        {22 b0 3b},3f,d4d5,'0001:模糊的污点','0002:挡风玻璃结冰','0004:完全堵塞','0008:部分堵塞','0010:污点','0020:光线不足','0040:图像模糊','0080:道路上有飞尘','0100:光线较强','0200:自身眩目','oth:---'0400;//合法
$Input(10,range=0-65535,t0=val#256,t1=val%256){2f e0 10 03 t0 t1};//合法
$Button(7f+-);//合法
$Button(7f+-8);//合法
{19 02 09}id=149,num=null,start=d4,code=3,space=4,state=null;//合法
$lab(gg)//合法
$if(f[1][30]:00);//合法
$elseif(f[1][23]:02);//合法
$ELseif(f[1][23]:02);//合法
以下是逻辑错误共3项 : 
$Str();
&"行使里程",                      {22 c9 07},cf,d4*26244+d5*1024,.0,km;//不合逻辑，系数比例不对
&"行使里程",                      {22 c9 07},cf,d4*+d5*1024,.0,km;//不合法，运算符后无数字
$Str();//检查结束语

以下是警告共2项 : 
link{3e}1,2000ms,//一个字节
exit{20},//一个字节
