function dtc_rj(){
var rj_dtc = `

_S000_DD(){
:DTC
0100 [1]油门位置传感器失效;
0200 [2]油门位置传感器大于最大值 ;
0300 [3]油门位置传感器小于最小值 ;
0600 [6]制动踏板位置传感器失效 ;
0700 [7]制动踏板位置传感器大于最大值 ;
0800 [8]制动踏板位置传感器小于最小值;
0900 [9]档位失效(无档位信号);
0a00 [10]档位信号不可信;
0b00 [11]制动开关失效;
0d00 [13]预充电失败告警;
1000 [16]VCU本身器件损坏;
1100 [17]油门开关失效;
1200 [18]无BMS通信;
1300 [19]无电机控制器通信;
6500 [101]通讯故障;
6600 [102]硬件故障;
6700 [103]致命故障;
6800 [104]电机过载故障;
6900 [105]过流故障;
6a00 [106]母线电压过低;
6b00 [107]母线电压偏低;
6c00 [108]母线电压过高;
6d00 [109]母线电压偏高;
6e00 [110]控制器温度过高;
6f00 [111]控制器温度偏高;
7000 [112]电机温度过高;
7100 [113]电机温度偏高;
7200 [114]电控存储单元故障;
7300 [115]电流温度传感器故障;
7400 [116]控制器过载;
:END}
`
return rj_dtc
}
module.exports=dtc_rj