D:\RSGM\nodejs\UYPI_OUSS_2\KPLU\sysData.TXT :
Tue Aug 16 2022 20:31:17 GMT+0800 (中国标准时间) : 

[0a 参数 非法]  <==*"博世零件号",                    {22 f1 96},0a,d4-d7,;//line 630
[21 激活 值 格式 错误 或 不 合理] 00-01 <==*"前雾灯输入值",                  {22 e0 0b},21,d4,00-01,按下|02-03;//line 1060
[21 激活 值 格式 错误 或 不 合理] 锁定 <==[21 状态 参数 格式 错误] 解锁| <==*"SK2锁定状态",                   {22 d3 03},21,d80,锁定,解锁|;//line 1115
[21 激活 值 格式 错误 或 不 合理] 是 <==[21 状态 参数 格式 错误] 无| <==*"SK2写入状态",                   {22 d3 03},21,d40,是,无|;//line 1116
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[温度](Spec)//line 3274
$Display(){"正在装载数据流,请稍等..."}//line 3275
$SetPeriod(CAN,0/1000/100/0/6000)//line 3276
$Str(ByCheckBmsCell);//line 3277
*"温度",      {00 00 02 03 29 7f ff 05},cf,d2-40,.0,℃;//line 3278
*"温度",      {00 00 02 03 29 7f ff 05},cf,d3-40,.0,℃;//line 3279
*"温度",      {00 00 02 03 29 7f ff 05},cf,d4-40,.0,℃;//line 3280
*"温度",      {00 00 02 03 29 7f ff 05},cf,d5-40,.0,℃;//line 3281
*"温度",      {00 00 02 03 29 7f ff 05},cf,d6-40,.0,℃;//line 3282
*"温度",      {00 00 02 03 29 7f ff 05},cf,d7-40,.0,℃;//line 3283
*"温度",      {00 00 02 03 29 7f ff 05},cf,d8-40,.0,℃;//line 3284
*"温度",      {00 00 02 03 29 7f ff 05},cf,d10-40,.0,℃;//line 3285
*"温度",      {00 00 02 03 29 7f ff 05},cf,d11-40,.0,℃;//line 3286
*"温度",      {00 00 02 03 29 7f ff 05},cf,d12-40,.0,℃;//line 3287
*"温度",      {00 00 02 03 29 7f ff 05},cf,d13-40,.0,℃;//line 3288
*"温度",      {00 00 02 03 29 7f ff 05},cf,d14-40,.0,℃;//line 3289
*"温度",      {00 00 02 03 29 7f ff 05},cf,d15-40,.0,℃;//line 3290
*"温度",      {00 00 02 03 29 7f ff 05},cf,d16-40,.0,℃;//line 3291
*"温度",      {00 00 02 03 29 7f ff 05},cf,d18-40,.0,℃;//line 3292
*"温度",      {00 00 02 03 29 7f ff 05},cf,d19-40,.0,℃;//line 3293
*"温度",      {00 00 02 03 29 7f ff 05},cf,d20-40,.0,℃;//line 3294
*"温度",      {00 00 02 03 29 7f ff 05},cf,d21-40,.0,℃;//line 3295
*"温度",      {00 00 02 03 29 7f ff 05},cf,d22-40,.0,℃;//line 3296
*"温度",      {00 00 02 03 29 7f ff 05},cf,d23-40,.0,℃;//line 3297
*"温度",      {00 00 02 03 29 7f ff 05},cf,d24-40,.0,℃;//line 3298
*"温度",      {00 00 02 03 29 7f ff 05},cf,d26-40,.0,℃;//line 3299
*"温度",      {00 00 02 03 29 7f ff 05},cf,d27-40,.0,℃;//line 3300
*"温度",      {00 00 02 03 29 7f ff 05},cf,d28-40,.0,℃;//line 3301
*"温度",      {00 00 02 03 29 7f ff 05},cf,d29-40,.0,℃;//line 3302
*"温度",      {00 00 02 03 29 7f ff 05},cf,d30-40,.0,℃;//line 3303
*"温度",      {00 00 02 03 29 7f ff 05},cf,d31-40,.0,℃;//line 3304
*"温度",      {00 00 02 03 29 7f ff 05},cf,d32-40,.0,℃;//line 3305
*"温度",      {00 00 02 03 29 7f ff 05},cf,d34-40,.0,℃;//line 3306
*"温度",      {00 00 02 03 29 7f ff 05},cf,d35-40,.0,℃;//line 3307
*"温度",      {00 00 02 03 29 7f ff 05},cf,d36-40,.0,℃;//line 3308
*"温度",      {00 00 02 03 29 7f ff 05},cf,d37-40,.0,℃;//line 3309
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<Init exit 参数 不 存在>
$Init();//line 3312
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3312[link 参数 不 存在] $Init();//line 3312
<Init exit 参数 不 存在>
$Init();                                    //line 3315
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();                                    //line 3315[link 参数 不 存在] $Init();                                    //line 3315
<Init exit 参数 不 存在>
$Init();                                    //line 3318
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();                                    //line 3318[link 参数 不 存在] $Init();                                    //line 3318
<Init exit 参数 不 存在>
$Init();                                    //line 3321
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();                                    //line 3321[link 参数 不 存在] $Init();                                    //line 3321
<Init exit 参数 不 存在>
$Init();//line 3324
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3324[link 参数 不 存在] $Init();//line 3324
<Init exit 参数 不 存在>
$Init();//line 3327
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3327[link 参数 不 存在] $Init();//line 3327
<Init exit 参数 不 存在>
$Init();//line 3330
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3330[link 参数 不 存在] $Init();//line 3330
<Init exit 参数 不 存在>
$Init();//line 3333
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3333[link 参数 不 存在] $Init();//line 3333
<Init exit 参数 不 存在>
$Init();//line 3336
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3336[link 参数 不 存在] $Init();//line 3336
<Init exit 参数 不 存在>
$Init();//line 3339
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3339[link 参数 不 存在] $Init();//line 3339
<Init exit 参数 不 存在>
$Init();//line 3342
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3342[link 参数 不 存在] $Init();//line 3342
<Init exit 参数 不 存在>
$Init();//line 3345
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3345[link 参数 不 存在] $Init();//line 3345
<Init exit 参数 不 存在>
$Init();//line 3348
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3348[link 参数 不 存在] $Init();//line 3348
<Init exit 参数 不 存在>
$Init();//line 3351
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3351[link 参数 不 存在] $Init();//line 3351
<Init exit 参数 不 存在>
$Init();//line 3354
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3354[link 参数 不 存在] $Init();//line 3354
<Init exit 参数 不 存在>
$Init();//line 3357
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3357[link 参数 不 存在] $Init();//line 3357
<Init exit 参数 不 存在>
$Init();//line 3360
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3360[link 参数 不 存在] $Init();//line 3360
<Init exit 参数 不 存在>
$Init();//line 3363
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3363[link 参数 不 存在] $Init();//line 3363
<Init exit 参数 不 存在>
$Init();//line 3366
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3366[link 参数 不 存在] $Init();//line 3366
<Init exit 参数 不 存在>
$Init();//line 3369
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3369[link 参数 不 存在] $Init();//line 3369
<Init exit 参数 不 存在>
$Init();//line 3372
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 3372[link 参数 不 存在] $Init();//line 3372
[算式 格式 错误]d4*<--*"碰撞信号",            {22 e0 0c},cf,d4*,.0,;//line 3885
[循环 参数 不 合理]90<--*"可学习遥控钥匙数量",  {22 c1 01},3f,d4,'10-1f:1','20-2f:2','30-3f:4','40-4f:12','oth:---'90;//line 3870
[范围 参数 非法] --:10 <--*"钥匙数量",            {22 d3 01},3f,d4,'00:0','01:1','02:2','03:3','04:4','05:5','06:6','07:7','08:8','09:9','10:10','11:11','12:12','13:13','14:14','15:oth','--:10','oth:---';//line 3959
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[清故障码](Spec)//line 4504
$ClearDtc();//line 4505
{14 ff ff ff}//line 4506
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
[算式 格式 错误]d4*<--*"硬线-PWM(脉宽调制)碰撞信号",{22 e0 03},cf,d4*,.0,;//line 5062
<Init exit 参数 不 存在>
$Init();//line 6477
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 6477[link 参数 不 存在] $Init();//line 6477
<Init exit 参数 不 存在>
$Init();//line 6481
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 6481[link 参数 不 存在] $Init();//line 6481
[21 状态 参数 格式 错误] AT(CVT,DCT)|手动变速箱 <==*"TCU(变速箱控制单元)",         {22 c1 01},21,d4,01,AT(CVT,DCT)|手动变速箱;//line 6627
[0a 整体 格式 错误 或 缺少 分号]*"供应商电控单元硬件参考号2"      {22 f1 92},0a,d4-d13;//line 7966
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 9311
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[执行保养周期显示(SIA)保养灯重置](Spec)//line 9442
$//line 9443
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[执行保养周期显示(SIA)保养灯重置](Spec)//line 9484
$//line 9485
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 9470
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 9551
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 9592
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 9633
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU安装日期",                   {22 f1 9d},bb,"20"d4h".",d5h".",d6h;//line 9634
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"编程日期",                      {22 f1 99},bb,"20"d4h".",d5h".",d6h;//line 9635
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 9755
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 9835
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 9917
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 10045
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 10377
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 10659
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 10700
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 10741
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU安装日期",                   {22 f1 9d},bb,"20"d4h".",d5h".",d6h;//line 10742
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"编程日期",                      {22 f1 99},bb,"20"d4h".",d5h".",d6h;//line 10743
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 10863
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 10946
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 10985
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 11066
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 11194
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 11239
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 11274
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 11309
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 11473
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 11751
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 11868
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 11985
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 12026
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 12067
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU安装日期",                   {22 f1 9d},bb,"20"d4h".",d5h".",d6h;//line 12068
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"编程日期",                      {22 f1 99},bb,"20"d4h".",d5h".",d6h;//line 12069
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 12189
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 12269
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 12351
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 12479
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 12811
[bb 参数 非法] "20"d4h <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h,".",d5h,".",d6h;//line 12969
[bb 参数 非法] "20"d4h <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h,".",d5h,".",d6h;//line 13089
[bb 参数 非法] "20"d4h"." <==[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20"d4h".",d5h".",d6h;//line 13175
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 13549
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 13584
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 13619
[cf 整体 格式 错误]*"里程读数(上次)",                {22 f1 10},cf,d15d16d17,.0;//line 13775
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 13784
[16 参数 非法]  <==*"供应商ECU序列号",               {22 f1 8c},16,d4-d13,;//line 13897
[16 参数 非法]  <==*"供应商ECU序列号",               {22 f1 8c},16,d4-d13,;//line 13935
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 14227
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 14268
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 14516
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 14636
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 14676
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 14757
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 14879
[cf 整体 格式 错误]*"里程读数(上次)",                {22 f1 10},cf,d15d16d17,.0;//line 14910
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 14919
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 14962
[检查 每行 发现 的 不明 语法] *"年/月/日",                      {22 f1 8c}16,d11-d13;//line 14999
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 15199
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 15441
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 15485
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 15650
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 15770
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 15815
[cf 整体 格式 错误]*"刹车踏板实际位置",              {22 e0 23},cf,d4*1.0,%;//line 16091
[cf 整体 格式 错误]*"高压电池包长时放电功率",        {22 e0 21},cf,d4*1.0,千瓦;//line 16103
[cf 整体 格式 错误]*"高压电池包瞬时放电功率",        {22 e0 22},cf,d4*1.0,千瓦;//line 16104
[bb 参数 非法] d5h"." <==*"ECU制造日期",                   {22 f1 8b},bb,"20",d4h,".",d5h".",d6h;//line 16238
[3f 整体 格式 错误 或 缺少 分号]*"前排乘客安全气囊禁用开关状态",  {22 b0 01},3f,d5,'00-0f:占用','10-1f:未占用','20-2f:错误','30-3f:无信号/未配置','oth:预留'//line 16854
[3f 整体 格式 错误 或 缺少 分号]*"前排乘客安全带插锁(占位传感器)状态",{22 b0 01},3f,d6,'00-0f:安全带系上/没人','10-1f:已解开(已松开)/已占用&&已松开','30-3f:无信号/未配置','oth:预留'//line 16856
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$Display(EE){注意:测试仅限于在点火开关处于ON挡且发动机/电机未运行时执行}//line 16897
//PSW27();//line 16899
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$Display(EE){注意:测试仅限于在点火开关处于ON挡且发动机/电机未运行时执行}//line 16907
//PSW27();//line 16909
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$Display(EE){注意:测试仅限于在点火开关处于ON挡且发动机/电机未运行时执行}//line 16917
//PSW27();//line 16919
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+2[安全带未系报警](Spec)//line 17131
$Display(EE){"注意:测试将只限于在点火开关处于ON挡且发动机/电机未运行时执行"}//line 17132
$Send(){10 03};//line 17133
//SPW27();//line 17134
$Button();//line 17135
" 打开 "{2f d4 03 03 02 00 02 00};//line 17136
" 关闭 "{2f d4 03 03 00 00 02 00};//line 17137
$Send(){2f d4 03 00 02 00};//line 17138
//特殊功能//line 17657
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
[cf 整体 格式 错误]*"车速",                          {22 e1 02},cf,d4*1,km/h;//line 17065
[循环 参数 必须 搭配 oth 使用 否则 无效]04<--*"发动机防盗指示灯",              {22 d1 1c},3f,d5,'00:关闭','01:闪烁(2Hz)','02:闪烁(0.33Hz)','03:打开'04;//line 17040
[范围 参数 非法] 0th:- <--*"车速状态",                      {22 e0 17},3f,d6,'00:有效','01:无效','0th:-';//line 17930
[bb 参数 非法] d13a"/" <==*"年/月/日",                      {22 f1 8c},bb,d12a,"/",d13a"/",d14-d15a;//line 18598
[3f 整体 格式 错误 或 缺少 分号]*"远程信息处理系统类型配置",      {22 c0 03},3f,d5,'00:远程控制系统(TBOX)高配和斑马平台','01:远程控制系统(TBOX)高配和大通平台','02:远程控制系统(TBOX)低配和斑马平台','03:远程控制系统(TBOX)低配和大通平台','04:远程控制系统(TBOX)和上汽集团后方车辆监控系统(RVM)','05:远程控制系统(TBOX)和斑马后方车辆监控系统','06:远程控制系统(TBOX)和大通后方车辆监控系统','07:无远程控制系统','oth:-'//line 18703
[元素 整体 格式 错误] '单色-红色'<--*"氛围灯颜色",                    {22 c0 25},3f,d7,'00:无氛围灯','单色-红色','02:单色-蓝色','03:多色-7色','04:多色-16色','05:多色-32色','06:多色-64(静态)','07:多色-64色律动氛围灯(基础静态和动态功能)','oth:-';//line 18699
[3f 数组 开头 缺少 引号] ,'00-0f:一键升降(带防夹)','10-1f:后排乘客区电动玻璃一键自动下','20-2f:后排乘客区电动玻璃','oth:预留'40 <--*"后排乘客区车窗玻璃升降类型",    {22 c0 03},3f,d4,,'00-0f:一键升降(带防夹)','10-1f:后排乘客区电动玻璃一键自动下','20-2f:后排乘客区电动玻璃','oth:预留'40;//line 18700
[cf 整体 格式 错误]*"里程读数(上次)",                {22 f1 10},cf,d15d16d17,.0;//line 18780
[3f 整体 格式 错误 或 缺少 分号]*"系统状态",                      {22 e0 04},3f,d4,'00:LDC关闭','01:LDC开启','02:LDC故障','oth:预留'//line 19015
[cf 整体 格式 错误]*"防盗PIN码",                    {22 cf 10},cf,d4*4278190080/255+d5*16711680/255+d6*65280+d7*1,.0;                   //line 19816
[link 参数 整体 格式 非法] link{3e 00}1,3000ms,000//line 20325<--
<检查 Init 时 发现 不明 指令>
888,
</检查 Init 时 发现 不明 指令>
<Init exit 参数 不 存在>
$Init();//line 21436
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 21436[link 参数 不 存在] $Init();//line 21436
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
$Display(EE){"只有在以下任一元件被更换或调整了才需要复位自学习值：西门子发动机控制,飞轮,曲轴传感器."}//line 22332
***//line 22389
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
[循环 参数 不 合理]05<--*"发动机状态",                               {22 b4 03},3f,d4,'00:发动机关闭','01:发动机运行(默认)','02:发动机控制状态-发动机起动中','04:发动机停止','oth:---'05;//line 22512
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 23559
//+1[特殊功能](Spec)//line 24167
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[2][0]:05 && f[2][1]:71 && f[2][2]:03 && f[2][3]:af && f[2][4]:00 && f[2][5]:00);//line 24691
$Elseif(f[2][0]:05 && f[2][1]:71 && f[2][2]:03 && f[2][3]:af && f[2][4]:00 && f[2][5]:ff);//line 24695
$Elseif(f[2][0]:05 && f[2][1]:71 && f[2][2]:03 && f[2][3]:af && f[2][4]:00 && f[2][5]:02);//line 24699
$Else();//line 24703
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 24809
//无特殊功能//line 24929
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 25047
//+1[特殊功能](Spec)//line 25090
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 25234
//+1[特殊功能](Spec)//line 25276
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 25473
//+1[特殊功能](Spec)//line 25512
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 25725
//+1[特殊功能](Spec)//line 26566
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 26691
//+1[特殊功能](Spec)//line 26730
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 26915
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 27526
//+1[特殊功能](Spec)//line 27549
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 27917
//+1[特殊功能](Spec)//line 28127
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<Init exit 参数 不 存在>
$Init();//line 28131
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 28131[link 参数 不 存在] $Init();//line 28131
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 28536
//+1[特殊功能](Spec)//line 28548
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 28637
//+1[特殊功能](Spec)//line 28734
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 28846
//+1[特殊功能](Spec)//line 28953
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 29021
//+1[特殊功能]//line 29042
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$Display(EE){//line 29867
"该功能将完成发动机管理系统(ECM)中下述自适应值重置:",//line 29868
"1.重置节气门自适应值",//line 29869
"2.重置怠速转速自适应值",//line 29870
"3.重置爆震控制自适应值",//line 29871
"4.重置爆震点火时间自适应值",//line 29872
"5.重置燃油调整自适应值",//line 29873
"6.重置歧管绝对压力修正",//line 29874
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<Init exit 参数 不 存在>
$Init();LLLLL//line 29928
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();LLLLL//line 29928[link 参数 不 存在] $Init();LLLLL//line 29928
[Button 帧 后面 缺少 分号] "锁上"{2f e1 04 03 01}//line 30253<--
[Button 帧 后面 缺少 分号] "解锁"{2f e1 04 03 00}//line 30254<--
[Button 帧 后面 缺少 分号] "断开"{2f e1 02 03 00}//line 30266<--
[Button 帧 后面 缺少 分号] "吸合"{2f e1 02 03 01}//line 30267<--
[Button 帧 后面 缺少 分号] "锁上"{2f e1 04 03 01}//line 30253<--
[Button 帧 后面 缺少 分号] "解锁"{2f e1 04 03 00}//line 30254<--
[Button 帧 后面 缺少 分号] "断开"{2f e1 02 03 00}//line 30266<--
[Button 帧 后面 缺少 分号] "吸合"{2f e1 02 03 01}//line 30267<--
<Init exit 参数 不 存在>
$Init();//line 30376
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 30376[link 参数 不 存在] $Init();//line 30376
<init 头 参数 错误>
$Init(reset);//line 30492
</init 头 参数 错误>
<Init exit 参数 不 存在>
$Init(reset);//line 30492
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init(reset);//line 30492[link 参数 不 存在] $Init(reset);//line 30492
<检查 Init 时 发现 不明 指令>$Init(reset);//line 30492
</检查 Init 时 发现 不明 指令>
<Init exit 参数 不 存在>
$Init();//line 30503
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 30503[link 参数 不 存在] $Init();//line 30503
<Init exit 参数 不 存在>
$Init();//line 31000
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 31000[link 参数 不 存在] $Init();//line 31000
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
//+1[动作测试](Spec)//line 31030
$Send(){10 03}//line 31031
$PSW27();//line 31032
$Act();//line 31033
*"所有警告指示灯被点亮或熄灭",//line 31034
"打开"{2f d1 01 03 80 00 00 00 80 00 00 00}//line 31035
"关闭"{2f d1 01 03 00 00 00 00 80 00 00 00}//line 31036
$Send(){2f d1 01 03 00 00 00 00 80 00 00 00}//line 31037
$$$//line 31038
//+1[特殊功能]//密码待核对//line 31040
//+2[保养间隔复位]//line 31041
//+2[仪表自测试]//line 31042
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[1][1]:71 && f[1][2]:03 && f[1][3]:ac && f[1][4]:e0 && f[1][5]:10);//line 31280
$Else();//line 31282
$If(f[2][1]:71 && f[2][2]:03 && f[2][3]:ac && f[2][4]:e1 && f[2][5]:10);//line 31289
$Else();//line 31291
$If(f[3][1]:71 && f[3][2]:03 && f[3][3]:ac && f[3][4]:e2 && f[3][5]:10);//line 31298
$Else();//line 31300
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[1][1]:71 && f[1][2]:03 && f[1][3]:ac && f[1][4]:e7 && f[1][5]:10);//line 31325
$Else();//line 31328
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[1][1]:71 && f[1][2]:03 && f[1][3]:ac && f[1][4]:e8 && f[1][5]:10);//line 31343
$Else();//line 31346
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[1][1]:71 && f[1][2]:03 && f[1][3]:ac && f[1][4]:e4 && f[1][5]:10);//line 31361
$Else();//line 31364
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[1][1]:71 && f[1][2]:03 && f[1][3]:ac && f[1][4]:e5 && f[1][5]:10);//line 31379
$Else();//line 31382
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[1][1]:71 && f[1][2]:03 && f[1][3]:ac && f[1][4]:e6 && f[1][5]:10);//line 31397
$Else();//line 31400
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[1][1]:71 && f[1][2]:03 && f[1][3]:ac && f[1][4]:e3 && f[1][5]:10);//line 31415
$Else();//line 31418
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$Display(EE){//line 31516
"该功能将完成发动机管理系统(ECM)中下述自适应值重置:",//line 31517
"1.重置节气门自适应值",//line 31518
"2.重置怠速转速自适应值",//line 31519
"3.重置爆震控制自适应值",//line 31520
"4.重置爆震点火时间自适应值",//line 31521
"5.重置燃油调整自适应值",//line 31522
"6.重置歧管绝对压力修正",//line 31523
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[1][1]:71 && f[1][2]:03 && f[1][3]:ac && f[1][4]:e0 && f[1][5]:10);//line 31709
$Else();//line 31711
$If(f[2][1]:71 && f[2][2]:03 && f[2][3]:ac && f[2][4]:e1 && f[2][5]:10);//line 31718
$Else();//line 31720
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<Init exit 参数 不 存在>
$Init();//line 33184
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 33184[link 参数 不 存在] $Init();//line 33184
<Init exit 参数 不 存在>
$Init();//line 34680
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 34680[link 参数 不 存在] $Init();//line 34680
<Init exit 参数 不 存在>
$Init();//line 34684
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 34684[link 参数 不 存在] $Init();//line 34684
<Init exit 参数 不 存在>
$Init();//line 34748
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 34748[link 参数 不 存在] $Init();//line 34748
<Init exit 参数 不 存在>
$Init();//line 34937
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 34937[link 参数 不 存在] $Init();//line 34937
<Init exit 参数 不 存在>
$Init();//line 34941
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 34941[link 参数 不 存在] $Init();//line 34941
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 35028
//+1[特殊功能](Spec)//line 35080
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<Init exit 参数 不 存在>
$Init();//line 35128
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 35128[link 参数 不 存在] $Init();//line 35128
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 35422
//+1[特殊功能](Spec)//line 35442
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<Init exit 参数 不 存在>
$Init();//line 35569
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 35569[link 参数 不 存在] $Init();//line 35569
<Init exit 参数 不 存在>
$Init();//line 37635
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 37635[link 参数 不 存在] $Init();//line 37635
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 37848
//+1[特殊功能](Spec)//line 38698
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 39072
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<Init exit 参数 不 存在>
$Init();//line 39388
JustShow,//line 39389
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 39388[link 参数 不 存在] $Init();//line 39388
<检查 Init 时 发现 不明 指令>
JustShow,//line 39389
</检查 Init 时 发现 不明 指令>
<Init exit 参数 不 存在>
$Init();//line 39410
JustShow,//line 39411
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 39410[link 参数 不 存在] $Init();//line 39410
<检查 Init 时 发现 不明 指令>
JustShow,//line 39411
</检查 Init 时 发现 不明 指令>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 40560
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 41063
//无特殊功能//line 41120
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 41641
//+1[特殊功能](Spec)//line 41665
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<Init exit 参数 不 存在>
$Init();//line 41668
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 41668[link 参数 不 存在] $Init();//line 41668
[Display 尾部 格式 错误]$Display(ENTER){"通讯连接失败"}$Return();//line 41822
[Button 帧 后面 缺少 分号] "打开"{2f e0 01 03 01}//line 42012<--
[Button 帧 后面 缺少 分号] "关闭"{2f e0 01 03 00}//line 42013<--
[Button 帧 后面 缺少 分号] "打开"{2f e0 02 03 01}//line 42019<--
[Button 帧 后面 缺少 分号] "关闭"{2f e0 02 03 00}//line 42020<--
[Button 帧 后面 缺少 分号] "打开"{2f e0 03 03 01}//line 42026<--
[Button 帧 后面 缺少 分号] "关闭"{2f e0 03 03 00}//line 42027<--
[Button 帧 后面 缺少 分号] "打开"{2f e0 04 03 01}//line 42033<--
[Button 帧 后面 缺少 分号] "关闭"{2f e0 04 03 00}//line 42034<--
[Button 帧 后面 缺少 分号] "打开"{2f e0 01 03 01}//line 42012<--
[Button 帧 后面 缺少 分号] "关闭"{2f e0 01 03 00}//line 42013<--
[Button 帧 后面 缺少 分号] "打开"{2f e0 02 03 01}//line 42019<--
[Button 帧 后面 缺少 分号] "关闭"{2f e0 02 03 00}//line 42020<--
[Button 帧 后面 缺少 分号] "打开"{2f e0 03 03 01}//line 42026<--
[Button 帧 后面 缺少 分号] "关闭"{2f e0 03 03 00}//line 42027<--
[Button 帧 后面 缺少 分号] "打开"{2f e0 04 03 01}//line 42033<--
[Button 帧 后面 缺少 分号] "关闭"{2f e0 04 03 00}//line 42034<--
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 42583
//+1[特殊功能](Spec)//line 42836
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 42892
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 43065
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
<检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
+1[动作测试](Spec)//line 43365
//+1[特殊功能](Spec)//line 43546
</检查 sys 时 发现 不明 指令 或 菜单 指令 整体 格式 错误>
[检查 每行 发现 的 不明 语法] *"日期时间信息(时-分-秒)",               {22 b0 6d},2f,d7-d9s,":",d7-d9f,":",d7-d9m;//line 43697
<Init exit 参数 不 存在>
$Init();//line 44862
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 44862[link 参数 不 存在] $Init();//line 44862
<Init exit 参数 不 存在>
$Init();//line 44866
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 44866[link 参数 不 存在] $Init();//line 44866
<Init exit 参数 不 存在>
$Init();//line 44870
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 44870[link 参数 不 存在] $Init();//line 44870
[检查 每行 发现 的 不明 语法] *"日期时间信息(时-分-秒)",               {22 b0 6d},2f,d7-d9s,":",d7-d9f,":",d7-d9m;//line 44960
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[0][4]:01)//line 45507
$Else();//line 45512
$If(f[0][4]:01)//line 45531
$Else();//line 45536
$If(f[0][4]:01)//line 45555
$Else();//line 45560
$If(f[0][4]:01)//line 45579
$Else();//line 45584
$Sned(){11 01};//line 45600
$Sned(){10 03};//line 45602
$Sned(){14 ff ff ff};//line 45603
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<检查 嵌套 指令 时 发现 指令 整体 格式 错误>//菜单指令内部错误
$If(f[0][5]:ff)//line 47381
$Elseif(f[0][5]:00)//line 47384
$Else();//line 47397
</检查 嵌套 指令 时 发现 指令 整体 格式 错误>
<Init exit 参数 不 存在>
$Init();//line 47976
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 47976[link 参数 不 存在] $Init();//line 47976
<Init exit 参数 不 存在>
$Init();//line 47980
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 47980[link 参数 不 存在] $Init();//line 47980
<Init exit 参数 不 存在>
$Init();//line 47984
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 47984[link 参数 不 存在] $Init();//line 47984
<Init exit 参数 不 存在>
$Init();//line 50961
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 50961[link 参数 不 存在] $Init();//line 50961
<Init exit 参数 不 存在>
$Init();//line 50965
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 50965[link 参数 不 存在] $Init();//line 50965
<Init exit 参数 不 存在>
$Init();//line 50969
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 50969[link 参数 不 存在] $Init();//line 50969
<Init exit 参数 不 存在>
$Init();//line 55858
</Init exit 参数 不 存在>
[in 参数 不 存在] $Init();//line 55858[link 参数 不 存在] $Init();//line 55858
[21 激活 值 格式 错误 或 不 合理] 11 <==*"配置跟踪域",                         {22 f1 98},21,d4,11,有|无;//line 56525
<检查 嵌套 指令 时 发现 不明 指令>//菜单指令内部错误
&"当前的网络配置为:",{22 f1 10},16,d4-d11;//line 56555
&"当前的功能配置为:",{22 f1 01},16,d4-d19;//line 56556
&&&//line 56557
"确定"L1;//line 56558
</检查 嵌套 指令 时 发现 不明 指令>
[If 指令 括号 内 参数 非法] f[3][1]:f[2][3] <--$If(f[3][1]:f[2][3]);//line 56565
[If 指令 括号 内 参数 非法] f[1][1]:f[2][3] <--$If(f[1][1]:f[2][3]);//line 56570